import Image from 'next/image'
import { FC } from 'react'

export const CompanyInfo: FC = () => {
  return (
    <div className="flex w-full items-center justify-center bg-gray-300 px-10 py-4">
      <div className="mr-2 flex w-2/5 items-center justify-center">
        <Image className="rounded-md" src={'/Head_Office.jpg'} alt={'Head office'} width={400} height={400} />
      </div>

      <div className="w-2/5 overflow-hidden indent-10 text-sm">
        <div>
          <p>
            บริษัท อีพีแอนด์ เอส จำกัด ได้ก่อตั้งขึ้นในปี พ.ศ. 2535
            โดยทีมผู้บริหารที่มีประสบการณ์ในด้านเทาเวอร์เครนและลิฟท์โดยสารสำหรับงานก่อสร้างอาคาร
            ด้วยความมุ่งมั่นตั้งใจที่จะนำเสนอสินค้าที่มีคุณภาพและบริการที่รวดเร็วไว้วางใจได้ ทำให้บริษัทฯ
            ได้เติบโตอย่างรวดเร็วเป็นที่รู้จักเป็นอย่างดีในกลุ่มบริษัทผู้รับเหมาก่อสร้างของประเทศไทย
          </p>

          <br />

          <p>
            สำหรับเครื่องจักรให้เช่า บริษัทฯ มีทั้งเทาเวอร์เครน และ ลิฟท์โดยสาร สำหรับงานก่อสร้าง
            ให้เช่าทั้งระยะสั้นและระยะยาว มีขนาดแตกต่างกันให้เลือกเพื่อให้เหมาะสมกับหน่วยงานก่อสร้างแต่ละประเภท
          </p>

          <br />

          <p>
            ตลอดระยะเวลาหลายปีที่ดำเนินธุรกิจมา
            บริษัทฯได้มุ่งเน้นคุณภาพด้านบริการเป็นหัวใจจึงได้มีทีมงานฝ่ายบริการเพื่อให้บริการ ติดตั้ง รื้อถอน
            เพิ่มความสูง รวมถึงซ่อมแซม ตรวจเช็คบำรุงรักษาอย่างถูกวิธี
            พร้อมบริการอะไหล่อย่างครบถ้วนเพื่อลดความเสียหายในงานก่อสร้างเพื่อสร้างความมั่นใจให้แก่ลูกค้าที่ใช้บริการจากทางบริษัทฯ
          </p>
        </div>
      </div>
    </div>
  )
}
