import Image from 'next/image'
import { FC } from 'react'

export const CompanyInfo: FC = () => {
  return (
    <div className="w-full bg-white py-10">
      <div className="mx-auto flex max-w-7xl items-center justify-center gap-16">
        <Image src={'/Head_Office.jpg'} alt={'Head office'} width={600} height={600} />
        <div className="max-w-xl overflow-hidden indent-10">
          <div>
            <p>
              บริษัท ดับเบิลเอ เอสพี จำกัด ได้ก่อตั้งขึ้นในปี พ.ศ. 2560
              โดยทีมบริหารที่มีความเชี่ยวชาญในด้านการก่อสร้างมากว่า 25ปี
              ด้วยความมุ่งมั่นที่จะให้บริการและจัดจำหน่ายแบบหล่อคอนกรีตประเภทต่างๆ
              รวมถึงไปนั่งร้านและอุปกรณ์ต่างๆที่ช่วยในการก่อสร้างอย่างมืออาชีพ
              เพื่อช่วยให้งานของคุณเร็วขึ้นกว่าการใช้อุปกรณ์ก่อสร้างทั่วไป และมีคุณภาพในทุกขั้นตอนของโครงการ
              ด้วยราคาที่สมเหตุสมผล
            </p>

            <br />

            <p>
              นอกจากนี้ เรายังบริการให้คำแนะนำออกแบบพื้นที่ใช้งานจริง เพื่อประเมินราคา สอนติดตั้งและการใช้งานที่หน้างาน
              มีรายการคำนวณ ที่รับรองโดยสามัญวิศวกร
            </p>
          </div>
        </div>
      </div>
    </div>
  )
}
